import networkx as nx
from bfs import bfs_path
from dfs import dfs_path

G = nx.Graph()

edges = [
    # Група 1: 
    ("Іра", "Саша"), ("Іра", "Айдер"), ("Іра", "Марина"),
    ("Саша", "Айдер"), ("Саша", "Марина"),
    ("Айдер", "Марина"),

    # Група 2:
    ("Слава", "Андрій"), ("Слава", "Денис"), ("Слава", "Руслан"),
    ("Андрій", "Денис"), ("Андрій", "Руслан"),
    ("Денис", "Руслан"),

    # Додаткові звʼязки
    ("Слава", "Іра"), ("Слава", "Женя"), ("Іра", "Женя"),
    ("Маша", "Марина"), ("Маша", "Руслан"),
    ("Андрій", "Айдер"), ("Андрій", "Рома"), ("Айдер", "Юля"), ("Рома", "Юля")
]

G.add_edges_from(edges)

first = "Женя"
last = "Юля"

result = bfs_path(G, first, last)
print(f"Шлях до комунікації {first} з {last} - {result}")

result = dfs_path(G, first, last)
print(f"Шлях до комунікації {first} з {last} - {result}")